Public Attributes | List of all members
API_DimensionStandards_Head Struct Reference
Project Navigator
Contains common information related to dimension preference types. More...
#include <APIdefs_ViewSettings.hpp>
 Public Attributes
Int32  | index
The index is the current database index of the given dimension preference. References to any dimension preference are done through these indices. It goes from 1 to the maximum available dimension preference index.
short  | flags
The dimension preference flags.
char  | name [API_UniLongNameLen]
The name of the dimension preference as UTF-8 encoded C string, which appears in the appropriate dialogs.
API_Guid  | guid
The globally unique identifier (GUID) of the dimension preference; can be used for identifying dimension preference with ACAPI_Navigator_DimStand_Get and ACAPI_Navigator_DimStand_Search.
UInt64  | modiTime
The last time the dimension preference was modified as GSTime .
GS::UniString *  | uniStringNamePtr
Optional parameter for accessing the name of the dimension preference in UniString (UTF-16 encoded) format.
Detailed Description
Contains common information related to dimension preference types.
Remarks
This structure contains general information about an dimension preference. As a general rule, before calling any of the applicable functions, clear the whole structure, fill the necessary fields, then call the function. Clearing all fields in the structure is important for future compatibility; in the next API releases the fillers may have meanings. You can access long name in C string format (name) or in GS::UniString format (uniStringNamePtr). You can use UniString format for dimension preference operations to avoid loss of information due to character conversion. To achieve this set the pointer of a GS::UniString variable in the uniStringNamePtr field of the API_ModelViewOptions_Head structure. Otherwise always set this field to nullptr. You can identify dimension preferences by name. If you want to refer to an dimension preference by name, set the guid member to APINULLGuid. If you set uniStringNamePtr to point to a valid GS::UniString object, the content of the name character buffer is ignored.
Member Data Documentation
◆ flags
 API_DimensionStandards_Head::flags
The dimension preference flags.
 Value  | Description
 APIAttr_IsClientCreated  | In teamwork mode, indicates whether an dimension preference was created by the client and not sent with the changes yet.
◆ guid
 API_DimensionStandards_Head::guid
The globally unique identifier (GUID) of the dimension preference; can be used for identifying dimension preference with ACAPI_Navigator_DimStand_Get and ACAPI_Navigator_DimStand_Search.
◆ index
 API_DimensionStandards_Head::index
The index is the current database index of the given dimension preference. References to any dimension preference are done through these indices. It goes from 1 to the maximum available dimension preference index.
◆ modiTime
 API_DimensionStandards_Head::modiTime
The last time the dimension preference was modified as GSTime .
◆ name
 API_DimensionStandards_Head::name
The name of the dimension preference as UTF-8 encoded C string, which appears in the appropriate dialogs.
◆ uniStringNamePtr
 API_DimensionStandards_Head::uniStringNamePtr
Optional parameter for accessing the name of the dimension preference in UniString (UTF-16 encoded) format.